##########################################################
# Detection Name:
# PowerShell Execution
#
# Description:
# Identifies PowerShell process execution using Sysmon
# Event ID 1 and displays command-line and parent-process
# context for investigation.
#
# Data Source:
# Sysmon
#
# Event ID(s):
# 1 - Process Create
#
# MITRE ATT&CK Technique(s):
# T1059.001 - PowerShell
#
# Validation Status:
# Validated
#
# Author:
# Hupfen Dynamics
#
# Version:
# 1.0
#
# Last Updated:
# 2026-07-13
##########################################################

# SPL Query

index=* EventCode=1 Image="*\\powershell.exe"
| table _time, host, Image, CommandLine, ParentImage
| sort - _time